app/controllers/secret_messages_controller.rb

  def index
    @secret_messages = SecretMessage.all
---
SELECT * FROM "secret_messages"