app/controllers/users_controller.rb

def create
  @user = User.new(params[:user])
  if @user.save
---
INSERT INTO "users" ("updated_at", "crypted_password", "username", "password_salt", "persistence_token", "email", "created_at") VALUES('2009-08-02 22:14:46', '3b16394b3d832094e8a874f94c72057248b285a907666628ee9cbb947b3c667b203e06d33fbe977d84cd1a21ef1def41623986bb9f065dcf4c4c1247c5e7d7a5', 'admin', 'Cu8HgcMCIYqmcF95e5q3', 'a1016dbcc63d1fbf7e5804fb0caed9d4a522cc4d423da92ed2978785ac485b0ce105e1d85526256a2495b81840dd050ba88e60c75f21ee41709e4397a77cecd0', 'email2ants@gmail.com', '2009-08-02 22:14:46')